[
  {
    "city": "Paris",
    "country": "France",
    "clues": [
      "This city is home to a famous tower that sparkles every night.",
      "Known as the 'City of Love' and a hub for fashion and art."
    ],
    "fun_fact": [
      "The Eiffel Tower was supposed to be dismantled after 20 years but was saved because it was useful for radio transmissions!",
      "Paris has only one stop sign in the entire city—most intersections rely on priority-to-the-right rules."
    ],
    "trivia": [
      "This city is famous for its croissants and macarons. Bon appétit!",
      "Paris was originally a Roman city called Lutetia."
    ]
  },
  {
    "city": "Tokyo",
    "country": "Japan",
    "clues": [
      "This city has the busiest pedestrian crossing in the world.",
      "You can visit an entire district dedicated to anime, manga, and gaming."
    ],
    "fun_fact": [
      "Tokyo was originally a small fishing village called Edo before becoming the bustling capital it is today!",
      "More than 14 million people live in Tokyo, making it one of the most populous cities in the world."
    ],
    "trivia": [
      "The city has over 160,000 restaurants, more than any other city in the world.",
      "Tokyo's subway system is so efficient that train delays of just a few minutes come with formal apologies."
    ]
  },
  {
    "city": "New York",
    "country": "USA",
    "clues": [
      "Home to a green statue gifted by France in the 1800s.",
      "Nicknamed 'The Big Apple' and known for its Broadway theaters."
    ],
    "fun_fact": [
      "The Statue of Liberty was originally a copper color before oxidizing to its iconic green patina.",
      "Times Square was once called Longacre Square before being renamed in 1904."
    ],
    "trivia": [
      "New York City has 468 subway stations, making it one of the most complex transit systems in the world.",
      "The Empire State Building has its own zip code: 10118."
    ]
  },
  {
    "city": "London",
    "country": "United Kingdom",
    "clues": [
      "This city has a famous clock tower often incorrectly called by the name of its bell.",
      "Known for its underground tube system and red double-decker buses."
    ],
    "fun_fact": [
      "The London Underground is the oldest underground railway network in the world, opening in 1863.",
      "Despite its reputation for rain, London actually receives less annual rainfall than Rome, Barcelona, and even Sydney."
    ],
    "trivia": [
      "There are more than 170 museums in London, including the British Museum which houses over 8 million works.",
      "The Ceremony of the Keys at the Tower of London has taken place every night for over 700 years."
    ]
  },
  {
    "city": "Rome",
    "country": "Italy",
    "clues": [
      "This city contains an entire country within its borders.",
      "Famous for its ancient arena where gladiators once fought."
    ],
    "fun_fact": [
      "There's a secret passage called Passetto di Borgo that connects the Vatican to Castel Sant'Angelo, used by popes to escape danger.",
      "Romans toss about €1.5 million worth of coins into the Trevi Fountain each year, which is donated to charity."
    ],
    "trivia": [
      "Rome has more than 2,000 fountains, more than any other city in the world.",
      "The ancient Romans built over 50,000 miles of roads radiating from Rome, leading to the saying 'all roads lead to Rome.'"
    ]
  },
  {
    "city": "Sydney",
    "country": "Australia",
    "clues": [
      "This city is known for its distinctive opera house with sail-shaped shells.",
      "It has one of the largest natural harbors in the world."
    ],
    "fun_fact": [
      "The Sydney Opera House has over one million roof tiles covering approximately 1.62 hectares.",
      "Sydney's Harbour Bridge is nicknamed 'The Coathanger' due to its arch-based design."
    ],
    "trivia": [
      "Sydney has more than 100 beaches, including the famous Bondi Beach.",
      "The Sydney Opera House took 14 years to build, ten years longer than planned, and cost 14 times the original budget."
    ]
  },
  {
    "city": "Cairo",
    "country": "Egypt",
    "clues": [
      "This city sits near some of the world's most famous ancient triangular structures.",
      "The longest river in the world runs through this city."
    ],
    "fun_fact": [
      "Cairo is home to Al-Azhar University, founded in 970 CE, making it one of the oldest universities in the world.",
      "The city's name in Arabic, 'Al-Qahirah,' literally means 'The Vanquisher' or 'The Conqueror.'"
    ],
    "trivia": [
      "Greater Cairo has a population of over 20 million people, making it the largest city in Africa.",
      "The Great Pyramid of Giza was the tallest man-made structure in the world for nearly 4,000 years."
    ]
  },
  {
    "city": "Rio de Janeiro",
    "country": "Brazil",
    "clues": [
      "This city is famous for a giant statue of Christ with outstretched arms.",
      "Known for hosting the world's largest carnival celebration."
    ],
    "fun_fact": [
      "The name Rio de Janeiro means 'January River' - Portuguese explorers mistook the bay for a river mouth when they arrived in January 1502.",
      "Copacabana Beach's mosaic sidewalks were designed by landscape architect Roberto Burle Marx using a pattern inspired by Portuguese pavement."
    ],
    "trivia": [
      "Rio de Janeiro was once the capital of Portugal - the only European capital to exist outside of Europe.",
      "The Christ the Redeemer statue is struck by lightning about 3-5 times a year."
    ]
  },
  {
    "city": "Venice",
    "country": "Italy",
    "clues": [
      "This city has canals instead of streets and gondolas instead of taxis.",
      "Known for its carnival masks and Murano glass."
    ],
    "fun_fact": [
      "Venice is built on 118 small islands connected by approximately 400 bridges.",
      "The city is slowly sinking at a rate of 1-2 millimeters per year."
    ],
    "trivia": [
      "There are no cars or roads in Venice's historic center, making it Europe's largest urban car-free area.",
      "The Venetian gondolas are asymmetrical - they're slightly more weighted on the left side to counterbalance the gondolier's weight."
    ]
  },
  {
    "city": "Dubai",
    "country": "United Arab Emirates",
    "clues": [
      "This city boasts the world's tallest building.",
      "Known for artificial islands in the shape of palm trees and a world map."
    ],
    "fun_fact": [
      "Dubai's police force uses luxury cars like Lamborghinis, Ferraris, and Bugattis as patrol vehicles.",
      "In just 50 years, Dubai transformed from a small fishing village into one of the world's most futuristic cities."
    ],
    "trivia": [
      "The Burj Khalifa is so tall that you can watch the sunset from the base, then take an elevator to the top and watch it set again.",
      "Dubai Mall is the largest shopping mall in the world by total area, with over 1,200 stores."
    ]
  },
  {
    "city": "Moscow",
    "country": "Russia",
    "clues": [
      "This city's most famous landmark is a colorful cathedral with onion-shaped domes.",
      "Its subway stations are renowned for their artistic and ornate designs."
    ],
    "fun_fact": [
      "The Moscow Metro is so deep that it doubled as a bomb shelter during World War II.",
      "The Kremlin walls were originally white until they were painted red in the 1680s."
    ],
    "trivia": [
      "Moscow has more billionaires living in it than any other city in the world.",
      "The seven skyscrapers known as 'Stalin's Seven Sisters' were built in a distinctive Soviet architectural style known as Stalinist Gothic."
    ]
  },
  {
    "city": "Barcelona",
    "country": "Spain",
    "clues": [
      "This city is known for buildings designed by Antoni Gaudí, including a perpetually unfinished cathedral.",
      "Famous for its distinctive grid-pattern district called the Eixample."
    ],
    "fun_fact": [
      "The Sagrada Família has been under construction since 1882 and isn't expected to be completed until 2026 at the earliest.",
      "Barcelona's main boulevard, La Rambla, was once a sewage-filled stream outside the city walls."
    ],
    "trivia": [
      "Barcelona has 9 UNESCO World Heritage Sites, 7 of which were designed by Antoni Gaudí.",
      "The city is home to one of the largest football stadiums in Europe, Camp Nou, which can seat 99,354 spectators."
    ]
  },
  {
    "city": "Amsterdam",
    "country": "Netherlands",
    "clues": [
      "This city has more canals than Venice and more bridges than Paris.",
      "Famous for its narrow houses, which lean forward slightly by design."
    ],
    "fun_fact": [
      "Amsterdam's houses are famously narrow because property taxes were once based on house width.",
      "There are more bicycles than people in Amsterdam, with an estimated 881,000 bikes for 821,000 residents."
    ],
    "trivia": [
      "Amsterdam is built entirely on wooden poles - the Royal Palace alone stands on 13,659 wooden piles.",
      "The narrowest house in Amsterdam is just 2.02 meters (6'7\") wide, while the narrowest facade is only 1 meter wide."
    ]
  },
  {
    "city": "Bangkok",
    "country": "Thailand",
    "clues": [
      "This city's full ceremonial name is the longest city name in the world.",
      "Known for its floating markets and ornate shrines."
    ],
    "fun_fact": [
      "Bangkok's full ceremonial name is 168 letters long and holds the Guinness World Record for the longest place name.",
      "The city is sinking 2-3 centimeters every year due to excessive groundwater pumping."
    ],
    "trivia": [
      "Bangkok's official name in Thai is 'Krung Thep Maha Nakhon,' which means 'City of Angels.'",
      "The city has more than 400 Buddhist temples (wats) and is home to the world's largest solid gold Buddha statue."
    ]
  },
  {
    "city": "Istanbul",
    "country": "Turkey",
    "clues": [
      "This city is the only one in the world that spans two continents.",
      "It was previously known as Constantinople and Byzantium."
    ],
    "fun_fact": [
      "Istanbul has been the capital of three great empires: Roman, Byzantine, and Ottoman.",
      "The Grand Bazaar is one of the oldest and largest covered markets in the world, with over 4,000 shops."
    ],
    "trivia": [
      "The Hagia Sophia has served as a cathedral, a mosque, a museum, and now a mosque again throughout its 1,500-year history.",
      "Istanbul's Tünel funicular, built in 1875, is the second-oldest continuously operating underground railway in the world."
    ]
  },
  {
    "city": "Singapore",
    "country": "Singapore",
    "clues": [
      "This city-state is known for its strict cleanliness laws and ban on chewing gum.",
      "Home to an iconic hotel with an infinity pool on top of three towers."
    ],
    "fun_fact": [
      "Singapore's Changi Airport has a butterfly garden, a cactus garden, a sunflower garden, and even a movie theater – all free for travelers.",
      "The country's national symbol is the Merlion, a mythical creature with a lion's head and a fish's body."
    ],
    "trivia": [
      "Singapore has one of the world's lowest crime rates and has been called 'the world's safest city.'",
      "Despite being one of the smallest countries by land area, Singapore has the world's highest percentage of millionaires."
    ]
  },
  {
    "city": "Prague",
    "country": "Czech Republic",
    "clues": [
      "This city is known as the 'City of a Hundred Spires' for its numerous Gothic towers.",
      "Home to the world's largest ancient castle complex."
    ],
    "fun_fact": [
      "The Prague Astronomical Clock, installed in 1410, is the oldest astronomical clock still in operation.",
      "Prague Castle is listed in the Guinness Book of Records as the largest ancient castle complex in the world."
    ],
    "trivia": [
      "The Dancing House in Prague, designed by Frank Gehry, is nicknamed 'Fred and Ginger' after the famous dancers.",
      "Prague has been relatively untouched by wars, allowing its medieval architecture to remain largely intact."
    ]
  },
  {
    "city": "San Francisco",
    "country": "USA",
    "clues": [
      "This city is known for its iconic orange-red bridge and cable cars.",
      "Famous for its steep hills and Victorian-style houses known as 'Painted Ladies.'"
    ],
    "fun_fact": [
      "The Golden Gate Bridge's distinctive color is actually called 'International Orange' and was originally just a primer to protect the steel.",
      "Alcatraz Island was the site of the first lighthouse on the West Coast of the United States."
    ],
    "trivia": [
      "San Francisco's Chinatown is the oldest and largest in North America.",
      "The city's famous cable cars are the only moving National Historic Monument in the world."
    ]
  },
  {
    "city": "Vienna",
    "country": "Austria",
    "clues": [
      "This city is famous for its classical music heritage and coffeehouses.",
      "Known as the 'City of Music' and the 'City of Dreams.'"
    ],
    "fun_fact": [
      "Vienna's central cemetery (Zentralfriedhof) is one of the largest in the world and home to the graves of Beethoven, Schubert, and other famous composers.",
      "The snow globe was invented in Vienna in 1900 by surgical instrument maker Erwin Perzy."
    ],
    "trivia": [
      "Vienna has been ranked as the world's most livable city multiple times by the Economist Intelligence Unit.",
      "The Viennese coffeehouses have been listed by UNESCO as an Intangible Cultural Heritage."
    ]
  },
  {
    "city": "Marrakech",
    "country": "Morocco",
    "clues": [
      "This city is known for its medina, a walled medieval city with maze-like alleys.",
      "Famous for its souks (markets) and the blue houses of its neighboring town."
    ],
    "fun_fact": [
      "The red walls surrounding Marrakech's old city were built in the 12th century using a mixture of lime, earth, and hay.",
      "The central square, Jemaa el-Fnaa, transforms from a market during the day to an open-air dining area with storytellers and musicians at night."
    ],
    "trivia": [
      "Marrakech is known as the 'Red City' due to the color of its buildings and walls.",
      "The Koutoubia Mosque's minaret, built in the 12th century, was the model for the Giralda in Seville, Spain."
    ]
  },
  {
    "city": "Athens",
    "country": "Greece",
    "clues": [
      "This city is named after the goddess of wisdom and contains ruins of an ancient temple on a hill.",
      "Considered the birthplace of democracy and Western philosophy."
    ],
    "fun_fact": [
      "The Acropolis of Athens has survived for nearly 2,500 years, despite wars, explosions, and pollution.",
      "Athens hosted the first modern Olympic Games in 1896."
    ],
    "trivia": [
      "Athens is one of the oldest cities in the world, with a recorded history spanning over 3,400 years.",
      "The ancient Agora in Athens was where Socrates expounded his philosophy and where democracy was born."
    ]
  },
  {
    "city": "Hong Kong",
    "country": "China (Special Administrative Region)",
    "clues": [
      "This city has the most skyscrapers in the world.",
      "Known for its harbor views and nightly light show."
    ],
    "fun_fact": [
      "Hong Kong means 'Fragrant Harbor' in Cantonese, a name derived from the incense factories that once lined its shores.",
      "Hong Kong has the most Rolls Royces per capita in the world."
    ],
    "trivia": [
      "Hong Kong's tram system, dating back to 1904, is the only one in the world operated exclusively with double-decker trams.",
      "The city has the world's longest covered outdoor escalator system, stretching over 800 meters."
    ]
  },
  {
    "city": "Jerusalem",
    "country": "Israel/Palestine (contested)",
    "clues": [
      "This city is considered holy by three major world religions.",
      "Its old city is divided into four quarters: Muslim, Christian, Jewish, and Armenian."
    ],
    "fun_fact": [
      "Jerusalem has been destroyed and rebuilt at least 20 times throughout its history.",
      "The city has over 2,000 archaeological sites."
    ],
    "trivia": [
      "Jerusalem's Old City walls were built by Suleiman the Magnificent in the 16th century and stretch for approximately 4.5 km.",
      "The Western Wall receives around a million notes placed in its cracks by visitors each year."
    ]
  },
  {
    "city": "Cape Town",
    "country": "South Africa",
    "clues": [
      "This city sits beneath a famous flat-topped mountain.",
      "It's located near the point where two oceans meet."
    ],
    "fun_fact": [
      "Table Mountain is believed to be one of the oldest mountains in the world at approximately 600 million years old.",
      "Cape Town is home to the world's smallest floral kingdom, the Cape Floral Kingdom, with over 9,000 plant species."
    ],
    "trivia": [
      "Cape Town was the first city in Africa to get electricity in 1895.",
      "Robben Island, where Nelson Mandela was imprisoned for 18 years, is visible from Cape Town's coast."
    ]
  },
  {
    "city": "Buenos Aires",
    "country": "Argentina",
    "clues": [
      "This city is known as the 'Paris of South America' for its European-style architecture.",
      "Famous for tango dancing and colorful houses in the La Boca neighborhood."
    ],
    "fun_fact": [
      "Buenos Aires has the highest concentration of theaters in the world, with over 300 theaters.",
      "The city is home to the widest avenue in the world, 9 de Julio Avenue, which spans 140 meters with 20 lanes."
    ],
    "trivia": [
      "Buenos Aires' Recoleta Cemetery is known for its elaborate mausoleums and as the resting place of Eva Perón.",
      "The city's bookstore El Ateneo Grand Splendid is housed in a former theater and has been named one of the most beautiful bookstores in the world."
    ]
  },
  {
    "city": "Berlin",
    "country": "Germany",
    "clues": [
      "This city was once divided by a famous wall for nearly 30 years.",
      "Known for its vibrant nightlife and street art scene."
    ],
    "fun_fact": [
      "Berlin has more bridges than Venice - over 1,700 bridges spanning its many waterways.",
      "The Berlin Wall fell in 1989, but small sections still remain as historical monuments."
    ],
    "trivia": [
      "Berlin's public transportation system includes ferries as part of its regular service.",
      "The city's Tierpark Berlin is the largest zoo in Europe in terms of area."
    ]
  },
  {
    "city": "Seoul",
    "country": "South Korea",
    "clues": [
      "This city blends ancient palaces with ultra-modern skyscrapers.",
      "Famous for its K-pop culture and high-tech innovations."
    ],
    "fun_fact": [
      "Seoul's Lotte World Tower has the world's highest glass-bottomed observation deck.",
      "The city's metro system carries over 7 million passengers daily and is one of the most extensive in the world."
    ],
    "trivia": [
      "Seoul has a series of artificial floating islands on the Han River that change colors at night.",
      "Incheon International Airport, serving Seoul, has been rated the world's best airport multiple times."
    ]
  },
  {
    "city": "Kyoto",
    "country": "Japan",
    "clues": [
      "This city has over 1,600 Buddhist temples and 400 Shinto shrines.",
      "It was Japan's capital city for more than 1,000 years."
    ],
    "fun_fact": [
      "Kyoto was spared from atomic bombing during World War II because of its cultural significance.",
      "The city is home to Nintendo's headquarters."
    ],
    "trivia": [
      "Kyoto's Gion district is famous for geishas and traditional wooden machiya houses.",
      "The Fushimi Inari Shrine features over 10,000 vermilion torii gates that form a network of tunnels up the mountain."
    ]
  },
  {
    "city": "Mexico City",
    "country": "Mexico",
    "clues": [
      "This city was built on the ruins of an ancient Aztec capital on a lake.",
      "It's one of the largest metropolitan areas in the world."
    ],
    "fun_fact": [
      "Mexico City is slowly sinking at a rate of about 20 centimeters per year because it was built on the bed of a drained lake.",
      "The city has more museums than any other city in the world, with over 150 museums."
    ],
    "trivia": [
      "Mexico City's Chapultepec Park is one of the largest city parks in the Western Hemisphere, twice the size of Central Park.",
      "The ancient city of Tenochtitlan, upon which Mexico City was built, had advanced floating gardens called chinampas."
    ]
  },
  {
    "city": "Mumbai",
    "country": "India",
    "clues": [
      "This city is home to the world's largest film industry.",
      "Famous for its colonial-era train station and Gateway monument."
    ],
    "fun_fact": [
      "Mumbai's dabbawalas (lunchbox carriers) deliver over 200,000 homemade lunches daily with a 99.99% accuracy rate, earning them a Six Sigma rating.",
      "The city was originally a cluster of seven islands that were joined through land reclamation projects."
    ],
    "trivia": [
      "Mumbai's Dharavi is one of the largest slums in Asia but also one of the most productive, with an annual turnover of approximately $1 billion.",
      "The city's name comes from 'Mumba,' a form of the Hindu goddess Mumbadevi, combined with 'Aai,' meaning mother."
    ]
  },
  {
    "city": "Lisbon",
    "country": "Portugal",
    "clues": [
      "This city is built on seven hills and has a famous red suspension bridge.",
      "Known for its yellow trams and tile-covered buildings."
    ],
    "fun_fact": [
      "Lisbon is one of the oldest cities in Western Europe, predating London, Paris, and Rome by centuries.",
      "The city was almost completely destroyed by a massive earthquake in 1755, followed by a tsunami and fires."
    ],
    "trivia": [
      "The Vasco da Gama Bridge in Lisbon is one of the longest bridges in Europe at nearly 11 miles long.",
      "Lisbon's Alfama district survived the 1755 earthquake and maintains its medieval, Moorish-influenced layout."
    ]
  },
  {
    "city": "St. Petersburg",
    "country": "Russia",
    "clues": [
      "This city is known for its network of canals and bridges, earning it the nickname 'Venice of the North.'",
      "Famous for its White Nights when the sun barely sets during summer."
    ],
    "fun_fact": [
      "St. Petersburg's Hermitage Museum is home to around 70 cats that protect the artwork from rodents, continuing a tradition started by Empress Elizabeth in 1745.",
      "The city was built on a swamp, with workers dying by the thousands during its construction in the early 18th century."
    ],
    "trivia": [
      "St. Petersburg was renamed Petrograd (1914-1924) and then Leningrad (1924-1991) before returning to its original name.",
      "The city's Mariinsky Theatre is one of the world's most famous ballet and opera houses."
    ]
  },
  {
    "city": "Sydney",
    "country": "Australia",
    "clues": [
      "This city is known for its distinctive opera house with sail-shaped shells.",
      "It has one of the largest natural harbors in the world."
    ],
    "fun_fact": [
      "The Sydney Opera House has over one million roof tiles covering approximately 1.62 hectares.",
      "Sydney's Harbour Bridge is nicknamed 'The Coathanger' due to its arch-based design."
    ],
    "trivia": [
      "Sydney has more than 100 beaches, including the famous Bondi Beach.",
      "The Sydney Opera House took 14 years to build, ten years longer than planned, and cost 14 times the original budget."
    ]
  },
  {
    "city": "Vancouver",
    "country": "Canada",
    "clues": [
      "This city is surrounded by mountains and ocean, making it possible to ski and sail on the same day.",
      "Known for its film industry, earning it the nickname 'Hollywood North.'"
    ],
    "fun_fact": [
      "Vancouver's Stanley Park is larger than New York City's Central Park, spanning over 1,000 acres.",
      "The city has the longest uninterrupted waterfront path in the world, stretching 28 kilometers (17.4 miles)."
    ],
    "trivia": [
      "Vancouver consistently ranks among the top cities worldwide for quality of life and livability.",
      "The city has the highest density of residents in Canada and is one of the most ethnically diverse cities in the world."
    ]
  },
  {
    "city": "Dublin",
    "country": "Ireland",
    "clues": [
      "This city is known for its literary heritage and a famous dark stout beer.",
      "The Book of Kells, an illuminated manuscript from circa 800 AD, is housed here."
    ],
    "fun_fact": [
      "Dublin has the youngest population in all of Europe, with approximately 50% of its citizens being under 25 years of age.",
      "The iconic St. Patrick's Cathedral in Dublin was built on a site where St. Patrick is said to have baptized converts around 450 AD."
    ],
    "trivia": [
      "The famous Guinness Storehouse is Ireland's most popular tourist attraction, receiving over 1.7 million visitors annually.",
      "Dublin's O'Connell Bridge is unusual in that it is wider than it is long."
    ]
  },
  {
    "city": "Havana",
    "country": "Cuba",
    "clues": [
      "This city is known for its vintage American cars and colorful colonial architecture.",
      "Famous for its cigars, rum, and traditional music."
    ],
    "fun_fact": [
      "Havana's historic center (Habana Vieja) contains one of the most complete collections of Spanish colonial architecture in the Americas.",
      "Due to the U.S. embargo, Cubans have kept 1950s American cars running for over 60 years through ingenious mechanical improvisation."
    ],
    "trivia": [
      "El Capitolio in Havana was modeled after the U.S. Capitol but is actually slightly taller, wider, and more elaborate.",
      "Havana's Malecón is a 5-mile esplanade and seawall that serves as the city's social hub and 'living room.'"
    ]
  },
  {
    "city": "Stockholm",
    "country": "Sweden",
    "clues": [
      "This city is built on 14 islands connected by 57 bridges.",
      "Home to the Nobel Prize ceremony each year."
    ],
    "fun_fact": [
      "Stockholm's subway system is known as the world's longest art gallery, with installations in over 90 of its 100 stations.",
      "The city's Vasa Museum houses a nearly fully intact 17th-century ship that sank on its maiden voyage."
    ],
    "trivia": [
      "Stockholm was the first city to be awarded the European Green Capital title in 2010.",
      "The city hall features a Golden Hall adorned with 18 million pieces of gold mosaic."
    ]
  },
  {
    "city": "Petra",
    "country": "Jordan",
    "clues": [
      "This ancient city is carved into rose-colored rock cliffs.",
      "Famous for its appearance in 'Indiana Jones and the Last Crusade.'"
    ],
    "fun_fact": [
      "Petra was unknown to the Western world until 1812 when it was rediscovered by Swiss explorer Johann Ludwig Burckhardt.",
      "The city's water collection system was so sophisticated that it prevented flooding while providing abundant water in a desert region."
    ],
    "trivia": [
      "Petra was built by the Nabataeans, who carved channels in the rock to control water flow, creating an artificial oasis.",
      "The Treasury (Al-Khazneh), Petra's most famous structure, is believed to have been built in the 1st century AD."
    ]
  },
  {
    "city": "Edinburgh",
    "country": "United Kingdom",
    "clues": [
      "This city has a castle perched on an extinct volcano.",
      "Known for its annual arts festival and military tattoo."
    ],
    "fun_fact": [
      "Edinburgh has more than 500 literary references per square mile, leading to its designation as UNESCO's first City of Literature.",
      "The city has a hidden underground street, Mary King's Close, that was built over after the plague in the 17th century."
    ],
    "trivia": [
      "Edinburgh Castle sits atop Castle Rock, which was formed by a volcanic eruption about 340 million years ago.",
      "The Royal Mile, connecting Edinburgh Castle to the Palace of Holyroodhouse, is actually 1.12 miles long, making it a 'Royal Mile and a bit.'"
    ]
  },
  {
    "city": "Jaipur",
    "country": "India",
    "clues": [
      "This city is known as the 'Pink City' due to the color of its buildings.",
      "Famous for its wind palace (Hawa Mahal) with hundreds of windows."
    ],
    "fun_fact": [
      "Jaipur was painted pink in 1876 to welcome the Prince of Wales (later King Edward VII), as pink was considered the color of hospitality.",
      "The city was India's first planned city, designed according to principles of Vastu Shastra (Indian architectural science) and Shilpa Shastra (art and craft guidelines)."
    ],
    "trivia": [
      "Jaipur's Jantar Mantar is an astronomical observation site built in the early 18th century and is a UNESCO World Heritage site.",
      "The city forms one point of India's famous Golden Triangle tourist circuit, along with Delhi and Agra."
    ]
  },
  {
    "city": "Cusco",
    "country": "Peru",
    "clues": [
      "This city was once the capital of the Inca Empire.",
      "Known for its Spanish colonial architecture built atop Inca foundations."
    ],
    "fun_fact": [
      "Cusco was the historic capital of the Inca Empire and is considered the oldest continuously inhabited city in the Americas.",
      "The city's name in the Quechua language means 'navel of the world.'"
    ],
    "trivia": [
      "Cusco's main square, the Plaza de Armas, was once the heart of the Inca Empire and is surrounded by colonial buildings and churches.",
      "The city is the gateway to Machu Picchu, one of the New Seven Wonders of the World."
    ]
  },
  {
    "city": "Krakow",
    "country": "Poland",
    "clues": [
      "This city's historic center is a UNESCO World Heritage site.",
      "Known for its medieval Old Town and Wawel Castle."
    ],
    "fun_fact": [
      "Krakow's Main Market Square is one of the largest medieval town squares in Europe, measuring 200 meters by 200 meters.",
      "The city's Wawel Dragon statue breathes fire every few minutes, delighting visitors."
    ],
    "trivia": [
      "Krakow was the capital of Poland for over 500 years, from the 11th to the 17th century.",
      "The city's Jewish quarter, Kazimierz, was the center of Jewish life in Krakow for over 500 years."
    ]
  },
  {
    "city": "Salzburg",
    "country": "Austria",
    "clues": [
      "This city is the birthplace of a famous composer.",
      "Known for its baroque architecture and hilltop fortress."
    ],
    "fun_fact": [
      "Salzburg's Old Town is a UNESCO World Heritage site and one of the best-preserved city centers north of the Alps.",
      "The city's Hohensalzburg Fortress is one of the largest medieval castles in Europe."
    ],
    "trivia": [
      "Salzburg is the birthplace of Wolfgang Amadeus Mozart, one of the most famous composers in history.",
      "The city is the most popular filming location for 'The Sound of Music,' with many scenes shot in and around Salzburg."
    ]
    },{
    "city": "Toronto",
    "country": "Canada",
    "clues": [
      "This city is home to the tallest freestanding structure in the Western Hemisphere.",
      "Known for its diverse neighborhoods and the annual Toronto International Film Festival."
    ],
    "fun_fact": [
      "Toronto's CN Tower was the world's tallest tower for 32 years until 2007.",
      "The city has over 140 languages spoken, making it one of the most multicultural cities in the world."
    ],
    "trivia": [
      "Toronto's PATH is the largest underground shopping complex in the world, spanning 30 kilometers.",
      "The city's Yonge Street was once listed in the Guinness Book of Records as the longest street in the world."
    ]
  },
  {
    "city": "Melbourne",
    "country": "Australia",
    "clues": [
      "This city is known for its vibrant street art and coffee culture.",
      "Home to the Australian Open, one of the four Grand Slam tennis tournaments."
    ],
    "fun_fact": [
      "Melbourne was the capital of Australia from 1901 to 1927 before Canberra took over.",
      "The city has the largest tram network in the world outside of Europe."
    ],
    "trivia": [
      "Melbourne has been consistently ranked as one of the world's most livable cities.",
      "The Royal Exhibition Building in Melbourne is a UNESCO World Heritage site."
    ]
  },
  {
    "city": "Oslo",
    "country": "Norway",
    "clues": [
      "This city is known for its Viking history and modern architecture.",
      "Home to the Nobel Peace Prize ceremony."
    ],
    "fun_fact": [
      "Oslo's Vigeland Park is the largest sculpture park in the world by a single artist.",
      "The city's Holmenkollen Ski Museum is the oldest of its kind, dating back to 1923."
    ],
    "trivia": [
      "Oslo is one of the greenest cities in Europe, with over 50% of its area covered by forests and parks.",
      "The city's Opera House is designed to resemble a glacier floating in the fjord."
    ]
  },
  {
    "city": "Helsinki",
    "country": "Finland",
    "clues": [
      "This city is known for its design district and archipelago.",
      "Home to the iconic white Helsinki Cathedral."
    ],
    "fun_fact": [
      "Helsinki's Suomenlinna Sea Fortress is a UNESCO World Heritage site and one of the largest sea fortresses in the world.",
      "The city has more saunas than cars, with over 3 million saunas for a population of 1.5 million."
    ],
    "trivia": [
      "Helsinki was named the World Design Capital in 2012.",
      "The city's Temppeliaukio Church is carved directly into solid rock."
    ]
  },
  {
    "city": "Zurich",
    "country": "Switzerland",
    "clues": [
      "This city is known for its financial institutions and pristine lake.",
      "Home to the largest church clock face in Europe."
    ],
    "fun_fact": [
      "Zurich's Bahnhofstrasse is one of the most expensive shopping streets in the world.",
      "The city has over 1,200 fountains, all providing drinkable water."
    ],
    "trivia": [
      "Zurich is consistently ranked as one of the cities with the highest quality of life.",
      "The city's Grossmünster church is said to have been founded by Charlemagne."
    ]
  },
  {
    "city": "Geneva",
    "country": "Switzerland",
    "clues": [
      "This city is known for its international organizations and the Jet d'Eau fountain.",
      "Home to the European headquarters of the United Nations."
    ],
    "fun_fact": [
      "Geneva's Jet d'Eau fountain shoots water 140 meters into the air, making it one of the tallest fountains in the world.",
      "The city is home to the Large Hadron Collider, the world's largest particle physics laboratory."
    ],
    "trivia": [
      "Geneva is the birthplace of the Red Cross and the Geneva Conventions.",
      "The city's Flower Clock in the English Garden is a symbol of Geneva's watchmaking industry."
    ]
  },
  {
    "city": "Brussels",
    "country": "Belgium",
    "clues": [
      "This city is known for its waffles, chocolate, and the Atomium.",
      "Home to the headquarters of the European Union."
    ],
    "fun_fact": [
      "Brussels' Grand Place is considered one of the most beautiful squares in Europe and is a UNESCO World Heritage site.",
      "The city is home to over 800 different types of beer."
    ],
    "trivia": [
      "Brussels has more than 100 comic strip murals scattered throughout the city.",
      "The Manneken Pis, a small bronze statue of a boy urinating, is one of Brussels' most famous landmarks."
    ]
  },
  {
    "city": "Antwerp",
    "country": "Belgium",
    "clues": [
      "This city is known as the diamond capital of the world.",
      "Home to the Rubens House, the former home of the famous painter Peter Paul Rubens."
    ],
    "fun_fact": [
      "Antwerp's Central Station is often referred to as the 'Railway Cathedral' due to its stunning architecture.",
      "The city's port is one of the largest in Europe and the second-largest in the world."
    ],
    "trivia": [
      "Antwerp is home to the Diamond District, where 84% of the world's rough diamonds are traded.",
      "The city's Museum aan de Stroom (MAS) is one of the largest museums in Belgium."
    ]
  },
  {
    "city": "Copenhagen",
    "country": "Denmark",
    "clues": [
      "This city is known for its cycling culture and the Little Mermaid statue.",
      "Home to the oldest monarchy in Europe."
    ],
    "fun_fact": [
      "Copenhagen's Tivoli Gardens is one of the oldest amusement parks in the world, opening in 1843.",
      "The city aims to become the world's first carbon-neutral capital by 2025."
    ],
    "trivia": [
      "Copenhagen's Nyhavn harbor is famous for its colorful 17th-century townhouses.",
      "The city's Christiania neighborhood is a self-proclaimed autonomous area with its own set of rules."
    ]
  },
  {
    "city": "Auckland",
    "country": "New Zealand",
    "clues": [
      "This city is known as the 'City of Sails' due to its large number of yachts.",
      "Home to the Sky Tower, the tallest freestanding structure in the Southern Hemisphere."
    ],
    "fun_fact": [
      "Auckland is built on 53 volcanoes, all of which are considered dormant but not extinct.",
      "The city has more boats per capita than any other city in the world."
    ],
    "trivia": [
      "Auckland's Waitemata Harbour is one of the most beautiful natural harbors in the world.",
      "The city's Waiheke Island is known for its vineyards and olive groves."
    ]
  },
  {
    "city": "Wellington",
    "country": "New Zealand",
    "clues": [
      "This city is known for its windy weather and vibrant arts scene.",
      "Home to the national museum of New Zealand, Te Papa."
    ],
    "fun_fact": [
      "Wellington is the southernmost capital city in the world.",
      "The city's cable car is one of the steepest in the world, with a gradient of 1 in 5."
    ],
    "trivia": [
      "Wellington is often referred to as the 'Coolest Little Capital in the World.'",
      "The city's Weta Workshop is famous for its work on films like 'The Lord of the Rings' and 'Avatar.'"
    ]
  },
  {
    "city": "Reykjavik",
    "country": "Iceland",
    "clues": [
      "This city is known for its geothermal pools and northern lights.",
      "Home to the Hallgrímskirkja church, one of the tallest buildings in Iceland."
    ],
    "fun_fact": [
      "Reykjavik is the northernmost capital city in the world.",
      "The city's hot water comes directly from geothermal springs, making it one of the cleanest energy systems in the world."
    ],
    "trivia": [
      "Reykjavik's Blue Lagoon is one of the most visited attractions in Iceland.",
      "The city's name means 'Smoky Bay,' named after the steam rising from its hot springs."
    ]
  },
  {
    "city": "Manila",
    "country": "Philippines",
    "clues": [
      "This city is known for its historic Intramuros district and bustling markets.",
      "Home to the oldest university in Asia, the University of Santo Tomas."
    ],
    "fun_fact": [
      "Manila's Rizal Park is named after the national hero, José Rizal, who was executed there in 1896.",
      "The city's traffic is among the worst in the world, with an average speed of 15 km/h during rush hour."
    ],
    "trivia": [
      "Manila's Intramuros is a walled city built by the Spanish in the 16th century.",
      "The city's Binondo district is the oldest Chinatown in the world."
    ]
  },
  {
    "city": "Bogotá",
    "country": "Colombia",
    "clues": [
      "This city is known for its vibrant street art and the Gold Museum.",
      "Home to the largest network of bicycle routes in Latin America."
    ],
    "fun_fact": [
      "Bogotá's Salt Cathedral, located in the nearby town of Zipaquirá, is an underground church built inside a salt mine.",
      "The city's Ciclovía event closes over 120 kilometers of streets to cars every Sunday, allowing cyclists and pedestrians to take over."
    ],
    "trivia": [
      "Bogotá's La Candelaria district is known for its colonial architecture and colorful buildings.",
      "The city's Monserrate Hill offers panoramic views of Bogotá and is a popular pilgrimage site."
    ]
  },
  {
    "city": "Lima",
    "country": "Peru",
    "clues": [
      "This city is known for its colonial architecture and ceviche.",
      "Home to the historic Plaza Mayor and the Cathedral of Lima."
    ],
    "fun_fact": [
      "Lima is the second-largest desert capital city in the world after Cairo.",
      "The city's Larco Museum houses one of the largest collections of pre-Columbian art in the world."
    ],
    "trivia": [
      "Lima's Historic Center is a UNESCO World Heritage site.",
      "The city's Miraflores district is known for its parks, shopping, and ocean views."
    ]
  },
  {
    "city": "Santiago",
    "country": "Chile",
    "clues": [
      "This city is known for its Andean backdrop and vibrant nightlife.",
      "Home to the San Cristóbal Hill, which offers panoramic views of the city."
    ],
    "fun_fact": [
      "Santiago's Central Market is one of the best places in the city to try fresh seafood.",
      "The city's Metro system is one of the most modern and efficient in Latin America."
    ],
    "trivia": [
      "Santiago's La Chascona is a house museum dedicated to the poet Pablo Neruda.",
      "The city's Cerro Santa Lucía is a historic hill that offers a glimpse into Santiago's colonial past."
    ]
  },
  {
    "city": "Brasília",
    "country": "Brazil",
    "clues": [
      "This city is known for its modernist architecture and urban planning.",
      "Home to the National Congress of Brazil and the Palácio do Planalto."
    ],
    "fun_fact": [
      "Brasília was built in just 41 months, from 1956 to 1960, to serve as Brazil's new capital.",
      "The city's design, by Oscar Niemeyer and Lúcio Costa, resembles an airplane when viewed from above."
    ],
    "trivia": [
      "Brasília is a UNESCO World Heritage site due to its unique architectural and urban design.",
      "The city's Cathedral of Brasília is known for its hyperboloid structure and stunning stained glass."
    ]
  },
  {
    "city": "São Paulo",
    "country": "Brazil",
    "clues": [
      "This city is known for its skyscrapers, cultural institutions, and diverse food scene.",
      "Home to the São Paulo Museum of Art (MASP) and the Ibirapuera Park."
    ],
    "fun_fact": [
      "São Paulo is the largest city in the Southern Hemisphere by population.",
      "The city's Municipal Market is famous for its mortadella sandwiches and exotic fruits."
    ],
    "trivia": [
      "São Paulo's Avenida Paulista is one of the most important financial and cultural centers in Latin America.",
      "The city's Carnival is one of the largest in Brazil, second only to Rio de Janeiro's."
    ]
  },
  {
    "city": "Montevideo",
    "country": "Uruguay",
    "clues": [
      "This city is known for its Rambla, a long waterfront promenade.",
      "Home to the Mercado del Puerto, a historic market known for its grilled meats."
    ],
    "fun_fact": [
      "Montevideo is the southernmost capital city in the Americas.",
      "The city's Carnival is the longest in the world, lasting over 40 days."
    ],
    "trivia": [
      "Montevideo's Ciudad Vieja (Old City) is known for its colonial architecture and vibrant nightlife.",
      "The city's Estadio Centenario hosted the first FIFA World Cup final in 1930."
    ]
  },
  {
    "city": "Caracas",
    "country": "Venezuela",
    "clues": [
      "This city is known for its dramatic mountain backdrop and vibrant culture.",
      "Home to the birthplace of Simón Bolívar, the liberator of several South American countries."
    ],
    "fun_fact": [
      "Caracas is one of the most dangerous cities in the world, with a high crime rate.",
      "The city's Ávila Mountain is a popular destination for hiking and offers stunning views of the city."
    ],
    "trivia": [
      "Caracas' Teresa Carreño Cultural Complex is one of the largest cultural centers in South America.",
      "The city's Metro system is one of the most modern in Latin America, despite the country's economic challenges."
    ]
  },
  {
    "city": "Quito",
    "country": "Ecuador",
    "clues": [
      "This city is known for its well-preserved colonial center and proximity to the equator.",
      "Home to the Basilica del Voto Nacional, one of the largest neo-Gothic churches in the Americas."
    ],
    "fun_fact": [
      "Quito is the second-highest capital city in the world after La Paz, Bolivia.",
      "The city's historic center is one of the best-preserved in Latin America and is a UNESCO World Heritage site."
    ],
    "trivia": [
      "Quito's Mitad del Mundo monument marks the location of the equator.",
      "The city's TelefériQo cable car offers panoramic views of Quito and the surrounding Andes mountains."
    ]
  },
  {
    "city": "La Paz",
    "country": "Bolivia",
    "clues": [
      "This city is known for its dramatic setting in a canyon and its vibrant markets.",
      "Home to the Witches' Market, where traditional remedies and potions are sold."
    ],
    "fun_fact": [
      "La Paz is the highest administrative capital in the world, sitting at an altitude of over 3,600 meters.",
      "The city's Mi Teleférico cable car system is the longest and highest urban cable car network in the world."
    ],
    "trivia": [
      "La Paz's Valle de la Luna (Moon Valley) features unique rock formations that resemble a lunar landscape.",
      "The city's San Francisco Church is one of the most important colonial landmarks in Bolivia."
    ]
  },
  {
    "city": "Luxembourg City",
    "country": "Luxembourg",
    "clues": [
      "This city is known for its fortified medieval old town perched on sheer cliffs.",
      "Home to the European Court of Justice and the European Investment Bank."
    ],
    "fun_fact": [
      "Luxembourg City's Bock Casemates are a network of underground tunnels and fortifications that date back to the 17th century.",
      "The city is one of the wealthiest in the world, with a high standard of living."
    ],
    "trivia": [
      "Luxembourg City's Old Town is a UNESCO World Heritage site.",
      "The city's Grund district is known for its picturesque setting along the Alzette River."
    ]
  },
  {
    "city": "Valletta",
    "country": "Malta",
    "clues": [
      "This city is known for its Baroque architecture and historic fortifications.",
      "Home to St. John's Co-Cathedral, which houses Caravaggio's masterpiece 'The Beheading of St. John the Baptist.'"
    ],
    "fun_fact": [
      "Valletta is one of the smallest capital cities in the European Union by area.",
      "The city's Grand Harbour is one of the most beautiful natural harbors in the world."
    ],
    "trivia": [
      "Valletta is a UNESCO World Heritage site and is often referred to as the 'Fortress City.'",
      "The city's Upper Barrakka Gardens offer stunning views of the Grand Harbour."
    ]
  },
  {
    "city": "Riga",
    "country": "Latvia",
    "clues": [
      "This city is known for its Art Nouveau architecture and historic Old Town.",
      "Home to the largest market in Europe, housed in former Zeppelin hangars."
    ],
    "fun_fact": [
      "Riga's Old Town is a UNESCO World Heritage site and is one of the best-preserved medieval cities in Europe.",
      "The city's Central Market is one of the largest and most diverse in Europe, offering everything from fresh produce to traditional Latvian dishes."
    ],
    "trivia": [
      "Riga is known as the 'Paris of the North' due to its vibrant cultural scene and stunning architecture.",
      "The city's Freedom Monument is one of the most important symbols of Latvian independence."
    ]
  },
  {
    "city": "Tallinn",
    "country": "Estonia",
    "clues": [
      "This city is known for its well-preserved medieval Old Town and digital innovation.",
      "Home to the Alexander Nevsky Cathedral and Toompea Castle."
    ],
    "fun_fact": [
      "Tallinn's Old Town is one of the best-preserved medieval cities in Europe and is a UNESCO World Heritage site.",
      "The city is known as the 'Silicon Valley of Europe' due to its thriving tech industry."
    ],
    "trivia": [
      "Tallinn's Town Hall Square is one of the most iconic landmarks in the city and is home to the oldest pharmacy in Europe.",
      "The city's Kalamaja district is known for its colorful wooden houses and vibrant arts scene."
    ]
  },
  {
    "city": "Vilnius",
    "country": "Lithuania",
    "clues": [
      "This city is known for its Baroque architecture and historic Old Town.",
      "Home to the Gate of Dawn, a historic city gate with a famous chapel."
    ],
    "fun_fact": [
      "Vilnius' Old Town is one of the largest and most well-preserved in Eastern Europe and is a UNESCO World Heritage site.",
      "The city's Užupis district declared itself an independent republic in 1997, complete with its own constitution and flag."
    ],
    "trivia": [
      "Vilnius is known as the 'Jerusalem of the North' due to its historical significance as a center of Jewish culture.",
      "The city's Gediminas Tower is one of the most iconic landmarks in Lithuania."
    ]
  },
  {
    "city": "Warsaw",
    "country": "Poland",
    "clues": [
      "This city is known for its reconstructed Old Town and vibrant cultural scene.",
      "Home to the Palace of Culture and Science, a gift from the Soviet Union."
    ],
    "fun_fact": [
      "Warsaw's Old Town was almost completely destroyed during World War II but was meticulously rebuilt and is now a UNESCO World Heritage site.",
      "The city's Łazienki Park is one of the largest and most beautiful parks in Europe."
    ],
    "trivia": [
      "Warsaw is known as the 'Phoenix City' due to its ability to rise from the ashes of war.",
      "The city's Wilanów Palace is often referred to as the 'Polish Versailles.'"
    ]
  },
  {
    "city": "Budapest",
    "country": "Hungary",
    "clues": [
      "This city is known for its thermal baths and the Danube River.",
      "Home to the Buda Castle and the Hungarian Parliament Building."
    ],
    "fun_fact": [
      "Budapest's Széchenyi Thermal Bath is one of the largest spa complexes in Europe.",
      "The city's Chain Bridge was the first permanent bridge across the Danube in Hungary."
    ],
    "trivia": [
      "Budapest is often referred to as the 'Paris of the East' due to its stunning architecture and vibrant cultural scene.",
      "The city's Fisherman's Bastion offers panoramic views of the Danube and the Pest side of the city."
    ]
  },
  {
    "city": "Pristina",
    "country": "Kosovo",
    "clues": [
      "This city is known for its vibrant youth culture and recent history.",
      "Home to the Newborn Monument, a symbol of Kosovo's independence."
    ],
    "fun_fact": [
      "Pristina's National Library is one of the most unique and controversial buildings in the world due to its unusual architecture.",
      "The city's Bill Clinton Boulevard features a statue of the former U.S. president, who is highly regarded in Kosovo for his role in the 1999 NATO intervention."
    ],
    "trivia": [
      "Pristina is one of the youngest capital cities in Europe, both in terms of its population and its status as a capital.",
      "The city's Germia Park is a popular destination for hiking and outdoor activities."
    ]
  },
  {
    "city": "Sarajevo",
    "country": "Bosnia and Herzegovina",
    "clues": [
      "This city is known for its multicultural history and the assassination that sparked World War I.",
      "Home to the Baščaršija, a historic bazaar and cultural center."
    ],
    "fun_fact": [
      "Sarajevo is often referred to as the 'Jerusalem of Europe' due to its long history of religious and cultural diversity.",
      "The city's Latin Bridge is the site of the assassination of Archduke Franz Ferdinand in 1914, which led to the outbreak of World War I."
    ],
    "trivia": [
      "Sarajevo's Old Town is a mix of Ottoman and Austro-Hungarian architecture.",
      "The city hosted the 1984 Winter Olympics, the first Winter Games held in a socialist country."
    ]
  },
  {
    "city": "Skopje",
    "country": "North Macedonia",
    "clues": [
      "This city is known for its mix of ancient and modern architecture.",
      "Home to the Stone Bridge, a symbol of the city that dates back to the 6th century."
    ],
    "fun_fact": [
      "Skopje's Kale Fortress offers panoramic views of the city and the Vardar River.",
      "The city's Mother Teresa Memorial House is dedicated to the Nobel Peace Prize winner, who was born in Skopje."
    ],
    "trivia": [
      "Skopje is known as the 'City of Statues' due to the large number of statues erected as part of a controversial urban renewal project.",
      "The city's Old Bazaar is one of the oldest and largest in the Balkans."
    ]
  },
  {
    "city": "Tirana",
    "country": "Albania",
    "clues": [
      "This city is known for its colorful buildings and vibrant nightlife.",
      "Home to the Pyramid of Tirana, a former museum turned cultural center."
    ],
    "fun_fact": [
      "Tirana's Et'hem Bey Mosque is one of the oldest buildings in the city and features beautiful frescoes.",
      "The city's Bunk'Art museums are housed in former communist-era bunkers and offer a glimpse into Albania's history."
    ],
    "trivia": [
      "Tirana is known for its vibrant street art and murals, which have transformed the city's urban landscape.",
      "The city's Dajti Mountain offers stunning views of Tirana and is a popular destination for hiking and outdoor activities."
    ]
  },
  {
    "city": "Podgorica",
    "country": "Montenegro",
    "clues": [
      "This city is known for its mix of modern and historic architecture.",
      "Home to the Millennium Bridge, a symbol of the city's modernization."
    ],
    "fun_fact": [
      "Podgorica's Ribnica River and Bridge are some of the oldest landmarks in the city, dating back to the Roman era.",
      "The city's Gorica Hill offers panoramic views of Podgorica and the surrounding area."
    ],
    "trivia": [
      "Podgorica is one of the youngest capital cities in Europe, having become the capital of Montenegro in 2006.",
      "The city's Clock Tower is one of the few remaining Ottoman-era structures in Podgorica."
    ]
  },
  {
    "city": "Belgrade",
    "country": "Serbia",
    "clues": [
      "This city is known for its vibrant nightlife and historic fortresses.",
      "Home to the Belgrade Fortress, which overlooks the confluence of the Danube and Sava rivers."
    ],
    "fun_fact": [
      "Belgrade's Kalemegdan Park is one of the largest and most beautiful urban parks in Europe.",
      "The city's Skadarlija district is known as the 'Bohemian Quarter' and is a popular destination for dining and entertainment."
    ],
    "trivia": [
      "Belgrade is one of the oldest cities in Europe, with a history dating back over 7,000 years.",
      "The city's Ada Ciganlija is a river island turned peninsula that is a popular destination for swimming and outdoor activities."
    ]
  },
  {
    "city": "Zagreb",
    "country": "Croatia",
    "clues": [
      "This city is known for its historic Upper Town and vibrant street art.",
      "Home to the Museum of Broken Relationships, a unique museum dedicated to failed relationships."
    ],
    "fun_fact": [
      "Zagreb's Dolac Market is one of the most famous open-air markets in Europe, offering fresh produce and local specialties.",
      "The city's funicular is one of the shortest in the world, with a length of just 66 meters."
    ],
    "trivia": [
      "Zagreb's Upper Town is known for its medieval architecture and cobblestone streets.",
      "The city's Mirogoj Cemetery is one of the most beautiful in Europe, with its arcades and lush greenery."
    ]
  },
  {
    "city": "Ljubljana",
    "country": "Slovenia",
    "clues": [
      "This city is known for its green spaces and pedestrian-friendly city center.",
      "Home to the Ljubljana Castle, which offers panoramic views of the city."
    ],
    "fun_fact": [
      "Ljubljana's Triple Bridge is one of the most iconic landmarks in the city, connecting the historic Old Town with the modern city center.",
      "The city's Dragon Bridge is adorned with four dragon statues, which are symbols of Ljubljana."
    ],
    "trivia": [
      "Ljubljana is one of the smallest capital cities in Europe, with a population of just under 300,000.",
      "The city's Tivoli Park is the largest and most beautiful park in Ljubljana, offering a peaceful escape from the urban hustle."
    ]
  },
  {
    "city": "Sofia",
    "country": "Bulgaria",
    "clues": [
      "This city is known for its mix of ancient and modern landmarks.",
      "Home to the Alexander Nevsky Cathedral, one of the largest Orthodox cathedrals in the world."
    ],
    "fun_fact": [
      "Sofia's Serdika Archaeological Complex showcases ruins from the ancient Roman city of Serdica.",
      "The city's Vitosha Mountain is a popular destination for hiking and skiing, located just a short drive from the city center."
    ],
    "trivia": [
      "Sofia is one of the oldest cities in Europe, with a history dating back over 7,000 years.",
      "The city's Boyana Church is a UNESCO World Heritage site and is known for its medieval frescoes."
    ]
  },
  {
    "city": "Bucharest",
    "country": "Romania",
    "clues": [
      "This city is known for its grand architecture and vibrant nightlife.",
      "Home to the Palace of the Parliament, the second-largest administrative building in the world."
    ],
    "fun_fact": [
      "Bucharest's Village Museum is one of the largest open-air museums in Europe, showcasing traditional Romanian village life.",
      "The city's Arcul de Triumf is a smaller version of the Arc de Triomphe in Paris and is a symbol of Romania's independence."
    ],
    "trivia": [
      "Bucharest is often referred to as the 'Little Paris of the East' due to its grand architecture and wide boulevards.",
      "The city's Herăstrău Park is one of the largest and most beautiful parks in Bucharest, offering a peaceful escape from the urban hustle."
    ]
  },
  {
    "city": "Chisinau",
    "country": "Moldova",
    "clues": [
      "This city is known for its Soviet-era architecture and vibrant wine culture.",
      "Home to the Nativity Cathedral, one of the most important Orthodox churches in Moldova."
    ],
    "fun_fact": [
      "Chisinau's Cricova Winery is one of the largest wine cellars in the world, with over 120 kilometers of underground tunnels.",
      "The city's Stephen the Great Central Park is a popular destination for locals and tourists alike."
    ],
    "trivia": [
      "Chisinau is one of the greenest cities in Europe, with numerous parks and gardens.",
      "The city's Triumphal Arch is a symbol of Moldova's independence and is located in the heart of Chisinau."
    ]
  },
  {
    "city": "Tbilisi",
    "country": "Georgia",
    "clues": [
      "This city is known for its sulfur baths and historic Old Town.",
      "Home to the Narikala Fortress, which offers panoramic views of the city."
    ],
    "fun_fact": [
      "Tbilisi's Old Town is a mix of Persian, Byzantine, and Soviet architecture, reflecting the city's diverse history.",
      "The city's sulfur baths are fed by natural hot springs and have been used for centuries for their therapeutic properties."
    ],
    "trivia": [
      "Tbilisi is one of the oldest cities in Europe, with a history dating back over 1,500 years.",
      "The city's Peace Bridge is a modern pedestrian bridge that spans the Kura River and is illuminated at night."
    ]
  },
  {
    "city": "Yerevan",
    "country": "Armenia",
    "clues": [
      "This city is known for its pink tuff stone buildings and vibrant cultural scene.",
      "Home to the Cascade Complex, a massive stairway that offers panoramic views of the city."
    ],
    "fun_fact": [
      "Yerevan's Matenadaran is one of the oldest and largest repositories of ancient manuscripts in the world.",
      "The city's Republic Square is known for its stunning architecture and nightly fountain shows."
    ],
    "trivia": [
      "Yerevan is one of the oldest continuously inhabited cities in the world, with a history dating back to 782 BC.",
      "The city's Mount Ararat, though located in Turkey, is a symbol of Armenia and is visible from Yerevan on clear days."
    ]
  },
  {
    "city": "Baku",
    "country": "Azerbaijan",
    "clues": [
      "This city is known for its modern architecture and historic Old Town.",
      "Home to the Flame Towers, a trio of skyscrapers that are illuminated at night."
    ],
    "fun_fact": [
      "Baku's Old Town, known as Icherisheher, is a UNESCO World Heritage site and is one of the oldest inhabited cities in the world.",
      "The city's Heydar Aliyev Center, designed by Zaha Hadid, is one of the most iconic modern buildings in the world."
    ],
    "trivia": [
      "Baku is known as the 'City of Winds' due to the strong winds that blow through the city.",
      "The city's Maiden Tower is one of the most iconic landmarks in Baku and is shrouded in mystery and legend."
    ]
  },
  {
    "city": "Ashgabat",
    "country": "Turkmenistan",
    "clues": [
      "This city is known for its white marble buildings and grandiose architecture.",
      "Home to the Independence Monument, a symbol of Turkmenistan's sovereignty."
    ],
    "fun_fact": [
      "Ashgabat holds the Guinness World Record for the highest density of white marble buildings in the world.",
      "The city's Alem Cultural and Entertainment Center is home to the world's largest indoor Ferris wheel."
    ],
    "trivia": [
      "Ashgabat is one of the most isolated capital cities in the world, with strict visa requirements for visitors.",
      "The city's Neutrality Arch is a symbol of Turkmenistan's policy of neutrality and is one of the most iconic landmarks in Ashgabat."
    ]
  },
  {
    "city": "Tashkent",
    "country": "Uzbekistan",
    "clues": [
      "This city is known for its mix of Soviet-era architecture and Islamic landmarks.",
      "Home to the Chorsu Bazaar, one of the oldest and largest markets in Central Asia."
    ],
    "fun_fact": [
      "Tashkent's Metro is one of the most beautiful in the world, with each station featuring unique designs and artwork.",
      "The city's Amir Timur Museum is dedicated to the famous Central Asian conqueror and is one of the most visited museums in Tashkent."
    ],
    "trivia": [
      "Tashkent is one of the oldest cities in Central Asia, with a history dating back over 2,000 years.",
      "The city's Independence Square is one of the largest and most important public spaces in Tashkent."
    ]
  },
  {
    "city": "Astana",
    "country": "Kazakhstan",
    "clues": [
      "This city is known for its futuristic architecture and modern skyline.",
      "Home to the Bayterek Tower, a symbol of Kazakhstan's independence."
    ],
    "fun_fact": [
      "Astana's Khan Shatyr Entertainment Center is the largest tent in the world and features an indoor beach and shopping mall.",
      "The city's Nur-Astana Mosque is one of the largest in Central Asia and can accommodate up to 5,000 worshippers."
    ],
    "trivia": [
      "Astana was renamed Nur-Sultan in 2019 in honor of the country's first president, Nursultan Nazarbayev, but reverted to Astana in 2022.",
      "The city's EXPO 2017 site is a testament to Kazakhstan's commitment to renewable energy and sustainable development."
    ]
  },
  {
    "city": "Bishkek",
    "country": "Kyrgyzstan",
    "clues": [
      "This city is known for its Soviet-era architecture and proximity to the Tian Shan mountains.",
      "Home to the Ala-Too Square, the central square of the city."
    ],
    "fun_fact": [
      "Bishkek's Osh Bazaar is one of the largest and most vibrant markets in Central Asia, offering everything from fresh produce to traditional Kyrgyz crafts.",
      "The city's State Historical Museum is one of the largest museums in Central Asia and offers a glimpse into Kyrgyzstan's rich history."
    ],
    "trivia": [
      "Bishkek is one of the greenest cities in Central Asia, with numerous parks and tree-lined streets.",
      "The city's Manas Statue is a symbol of Kyrgyzstan's national hero and is one of the most iconic landmarks in Bishkek."
    ]
  },
  {
    "city": "Dushanbe",
    "country": "Tajikistan",
    "clues": [
      "This city is known for its Soviet-era architecture and vibrant bazaars.",
      "Home to the Rudaki Park, a popular destination for locals and tourists alike."
    ],
    "fun_fact": [
      "Dushanbe's Flagpole is one of the tallest in the world, standing at 165 meters.",
      "The city's National Museum of Tajikistan is one of the largest and most important museums in Central Asia."
    ],
    "trivia": [
      "Dushanbe is one of the youngest capital cities in Central Asia, having become the capital of Tajikistan in 1929.",
      "The city's Hissar Fortress is one of the most important historical landmarks in Tajikistan and offers a glimpse into the country's rich history."
    ]
  },{
    "city": "New Delhi",
    "country": "India",
    "clues": [
      "This city is the capital of the world's largest democracy.",
      "Home to a historic red sandstone fort and a towering minaret."
    ],
    "fun_fact": [
      "New Delhi was designed by British architects Sir Edwin Lutyens and Sir Herbert Baker in the early 20th century.",
      "The Delhi Metro is one of the largest and most advanced rapid transit systems in the world."
    ],
    "trivia": [
      "New Delhi is home to India Gate, a war memorial dedicated to soldiers who died in World War I.",
      "The Rashtrapati Bhavan, the official residence of India's President, is one of the largest presidential residences in the world."
    ]
  },
  {
    "city": "Bangalore",
    "country": "India",
    "clues": [
      "This city is known as the 'Silicon Valley of India' due to its booming tech industry.",
      "Famous for its pleasant climate and numerous gardens."
    ],
    "fun_fact": [
      "Bangalore has more than 8,000 startups, making it one of the biggest startup hubs in the world.",
      "The city is home to Lalbagh Botanical Garden, which has a 3,000-million-year-old rock formation."
    ],
    "trivia": [
      "Bangalore's Cubbon Park spans over 300 acres and is home to over 6,000 trees and plants.",
      "The city has India's highest number of engineering colleges, producing a large number of tech professionals every year."
    ]
  }
]